Repository: Mopolo/mopolo.github.io
Catalog: resources/i18n/*.xlf
Languages: fr

# site.general.date.maintenant
source: Now
fr: Présent

# site.general.techs
source: Techs :
fr: Technologies :

# site.menu.index
source: Home
fr: Accueil

# site.menu.work
source: Work
fr: Expérience

# site.menu.projects
source: Projects
fr: Projets

# site.menu.studies
source: Studies
fr: Études

# site.pages.studies
source: Studies
fr: Études

# site.pages.contact.email
source: My email is
fr: Mon Email :

# site.pages.contact.linkedin
source: You can also find me on
fr: Je suis aussi sur

# site.pages.work
source: Work
fr: Expérience

# work.tde.intro
source: TotalEnergies is a French electric utility company which produces and distributes gas and electricity.
fr: TotalEnergies est un fournisseur et producteur d'électricité et de gaz.

# work.tde.summary
source: Complete refactor of the website and the API.
fr: Refontes complètes de l'espace client particuliers et de l'API pour l'app mobile.

# work.tde.site.name
source: Site
fr: Site web

# work.tde.site.highlights
source: TYPO3 configuration (pages, options, etc.) Subscription form with complex steps Consumption simulator Client login flow Admin login flow Logging tool for WebServices and errors Internal tools (e.g. monitoring)
fr: Configuration TYPO3 (pages, options, etc.) Formulaire de souscription avec étapes Simulateur de consommation Connexion client et admin Outils de log interne CI (Jenkins, Docker, Pull Requests, PHPStan) Rituels (Code review et présentations internes)

# work.tde.micro.summary
source: This micro framework was developed to access the company's data the same way in the website and the API.
fr: Ce micro framework permet un accès central à toutes les données du SI. Il est importé via composer dans le site et l'api.

# work.tde.micro.highlights
source: Composer for dependencies Standalone Doctrine setup for several databases Custom library to call SOAP and HTTP WebServices Enum system to handle business "magic constants" Documentation with MkDocs Unit and feature tests using PHPUnit Code analysis with PHPStan
fr: Configuration standalone de Doctrine Librairie maison pour les webservices (SOAP, HTTP, Queues) Système d'énumérations via MagicConstant Documentation technique avec Mkdocs Tests unitaires avec PHPUnit Analyse statique du code avec PHPStan

# work.tde.api.highlights
source: Built using Laravel OAuth via Laravel Passport Documentation OpenAPI
fr: OAuth via Laravel Passport Documentation OpenAPI

# work.globalis.intro
source: Globalis is an IT service company based in Paris. I was on mission at L'Obs.
fr: Globalis est une SSII basée à Paris. J'étais en régie au Nouvel Obs.

# work.globalis.summary
source: Developments on the Nouvel Obs website
fr: Évolutions sur le site web du magasine Nouvel Obs.

# work.globalis.obs.summary
source: The Nouvel Obs is a French online and paper magazine.
fr: Le Nouvel Obs est un magasine français. J'ai travaillé sur la version web.

# work.globalis.obs.highlights
source: Home made PHP framework Started and helped the transition from SVN to Git Setup of an internal Gitlab Backoffice to visualize create pages Worked on the complete refactor of the Article page Discovery of Docker as a dev environment
fr: Framework PHP interne Démarrage de la migration de SVN vers Git Mise en place d'un Gitlab Création d'un backend de création visuelle de pages Refactor complet de la page Article Découverte de Docker

# work.osedea.intro
source: Osedea is a web agency based in Montréal, Québec. I started as an intern and continued on as an employee. The company was small when I started, so I had the opportunity to build/discover a lot. It was also my first time working on macOS and with a different keyboard layout than the french one.
fr: Osedea est une agence basée à Montréal dans laquelle j'ai démarré comme stagiaire puis continué comme employé.

# work.osedea.summary
source: Development of different sites and mobile apps.
fr: Développement de divers sites web et apps mobiles dans une agence Québequoise.

# work.osedea.wss.summary
source: WeSpeakStudent is the first big project I worked on at Osedea.
fr: WeSpeakStudent est le premier gros projet que j'ai réalisé à Osedea.

# work.osedea.wss.backend.highlights
source: Built with Zend framework 2 and Doctrine Emails are sent using Mandrill Schools, accounts, students management Paiements dashboard Documents manager Google Analytics dashboard Push notifications Student backend to manager their school's app Rest API
fr: Utilise Zend et Doctrine Emails envoyés via Mandrill Gestion des écoles, comptes de directeurs d'école Données des étudiants Affichage des paiements Gestion de documents Extraction des données Google Analytics Planification de notifications push Accès étudiant pour gérer leur app : news, évènements, élections, sondages API Rest pour le site et les apps

# work.osedea.wss.site.highlights
source: Build with AngularJS Responsive and multi-lang Students can pay for their health insurance using Stripe Setup of prerender.io for SEO
fr: Utilise AngularJS Responsive et multi-langue Paiements via Stripe Utilisation de prerender.io pour le SEO

# work.osedea.wss.apps.highlights
source: Built with Ionic Released on iOs and Android One app per school (example) Public transport information is available using the GTFS standard
fr: Utilise Ionic Version iOs et Android Une app par école Infos des transports publics via GTFS

# work.osedea.morcare.summary
source: Morcare is an international version of WeSpeakStudent.
fr: Morecare est une version internationalle de WeSpeakStudent

# work.osedea.arcelormittal.summary
source: We built a tool to help with vehicle usage planing in a mine in Canada. The assigning of vehicles was based on a lot of parameters and was done semi-manually using Excel. The tool consists of a web app built with Zend 2 and AngularJS. It was able to assign vehicles automatically based on different criteria. This project allowed us to visit San Francisco for 4 days and participate in the [2014 Tech Crunch's Disrupt SF Hackathon](https://techcrunch.com/2014/09/07/git-bounty-wants-to-help-open-source-programmers-get-paid-for-bug-fixes/).
fr: Webapp permettant la gestion d'équipements d'une mine au Canada. La gestion était anciennement faite via un fichier Excel. La webapp permettait d'attribuer les équipements de la mine de façon automatique en fonction de plusieurs critères. Ce projet nous a permit de visiter San Francisco pendant 4 jours et participer au <a href="https://techcrunch.com/2014/09/07/git-bounty-wants-to-help-open-source-programmers-get-paid-for-bug-fixes/" class="text-purple-500 dark:text-purple-400 underline">Disrupt SF Hackathon de Tech Crunch de 2014</a>.

# work.osedea.familyreach.summary
source: FamilyReach Give is a crowdfunding app to help families who have a child with cancer.
fr: FamilyReach Give est une application de financement participatif pour aider des familles américaines ayant un enfant qui a un cancer.

# work.osedea.familyreach.backend.highlights
source: Built with Laravel and AngularJS The association people can manage families, payments and parameters Data is exposed via a REST APi
fr: Utilise Laravel et AngularJS Gestion des familles, paiements et paramètres Données exposées via une API REST

# work.osedea.familyreach.app.highlights
source: Built with Ionic Payments in-app using Stripe
fr: Utilise Ionic Paiement in-app via Stripe

# work.osedea.gigleaf.summary
source: Gigleaf is a website that helps freelance artists to find gigs.
fr: Ce site permet de mettre en relation des artistes freelances avec des recruteurs.

# work.osedea.gigleaf.highlights
source: Built with Laravel Single Page Application Queued jobs using Beanstalk Task scheduling using Laravel scheduler Emailing using Mandrill API
fr: Site de mise en relation d'artistes freelance et de recruteurs Backend avec Laravel Frontend en SPA avec AngularJS Envoi d'emails via Mandrill Queues via Beanstalk

# work.osedea.simply-obstetrics.summary
source: This is the first project I worked on during my internship at Osedea. It's an app for doctors made using Ionic. All the content is static.
fr: Application Ionic d'informations médicales. Les données sont statiques.

# work.osedea.osd.summary
source: Osd is a tool for the terminal that I started building and kept working on for the entire time I was in the company. It was first built as a single bash script but was quickly rebuilt using Node.js It allowed to automate some of the company's processes.
fr: Outil interne pour le terminal que j'ai créé puis maintenu pendant tout mon temps à Osedea. La première version était écrite en bash puis ça a été refactor en Node.js Il permet l'automatisation de plusieurs processus interne.

# work.osedea.osd.highlights
source: SSH aliases management Projects versions management (git tags, package.json) Cordova projects compilation to iOs or Android Time management Project skeleton generation Code snippets generation
fr: Outil interne pour le terminal Gestion des alias SSH Gestion des versions des projets (tags git, mise à jour des package.json) Compilation des app Ionic/Cordova vers iOs et Android Gestion du temps de travail Générateur de squelette de projet Générateur de snippets de code

# work.morningcroissant.intro
source: MorningCroissant is a house rental platform for your or other people's places.
fr: MorningCroissant est un site de location de logements meublés.

# work.morningcroissant.summary
source: I did a six months internship in this company in Paris. I've done many things such as:
fr: Évolutions et maintenance sur un site web de location de logements meublés.

# work.morningcroissant.website.highlights
source: A drag&drop uploader for photos HTML integration of psd models SEO Wikipedia crawler Improvements on the internal search engine A/B testing solution Visual calendar to choose availabilities
fr: Upload de photos en Drag&Drop Intégration de maquettes SEO Création d'un crawler Wikipedia Moteur de recherche Mise en place d'A/B tests Calendrier visuel

# work.ratp.intro
source: The Régie Autonome des Transports Parisiens (RATP) is the public transport operator of Paris and it's surroundings.
fr: La Régie Autonome des Transports Parisiens (RATP) est le service des transports en commun d'Île-de-France.

# work.ratp.summary
source: Development of an internal app for the Paris subway.
fr: Développement d'une application intranet pour la maintenance des rames de métro.

# studies.licence
source: Licence in IT
fr: Licence info

# studies.dut
source: DUT in IT
fr: DUT info

# projects.forlhorn
source: Minecraft RPG server currently being developed. In this project I am creating several systems: money, dungeons and portals. I am also doing code architecture (IOC Container, ORM, Query Bus, unit tests, etc).
fr: Serveur Minecraft de type RPG en cours de développement. Dans ce projet je développe plusieurs systèmes : monnaie, donjons et portails. Je mets également en place l'architecture générale du code (Container, ORM, Query Bus, tests unitaires, etc).

# projects.webz
source: WebZ is a library that aims to abstract calls to different WebServices (in HTTP or SOAP). It automatically handles caching, events and parsing results to an array.
fr: Librairie d'abstraction d'appels à différents WebServices (en HTTP ou SOAP). Elle gère automatiquement le cache, les évènements et de parser le résultat en tableau.

# projects.magic-constant
source: PHP implementation of enumerations that can manage multiple formats. It was developed at Direct Energie before being open sourced.
fr: Implémentation PHP d'énumération avec gestion de multiples formats. Cette librairie a d'abord été développée pour Direct Energie avant de devenir open source.

# projects.radiophonix
source: Radiophonix was a free and open-source platform to publish and listen to french audio fictions (also known as &ldquo;Sagas MP3&rdquo;). It was written in JavaScript (with Vue.js) and PHP (with Laravel). I also started to discover TypeScript. This project was also a way to use GitLab for dynamic environments used in Pull Requests. The design is from the very talented [Pierre](https://www.pierre.tl/realisations/radiophonix/). Pierre and I were invited to present the project in public for the first time at the 2019 edition of [MP3@Paris](http://www.mp3aparis.fr).
fr: Radiophonix était une plateforme libre et gratuite de publication et d'écoute de Sagas MP3 écrite en JavaScript à l'aide de Vue.js et l'API en PHP à l'aide de Laravel. Cela a été l'occasion de mettre en place un système d'environnements dynamiques pilotés via GitLab et utlisés pour les Pull Requests. J'y ai aussi commencé ma découverte du TypeScript. Le design vient du très talentueux <a href="https://www.pierre.tl/realisations/radiophonix/" class="text-orange-400 underline">Pierre</a>. Pierre et moi avons été invités à présenter le site en public pour la première fois à l'édition 2019 de <a href="http://www.mp3aparis.fr" class="text-orange-400 underline">MP3@Paris</a>.

# projects.portfolio
source: I like to redo my portfolio from time to time. I used different technologies throughout the years: Jekyll (ruby), Jigsaw (PHP) and now custom PHP.
fr: J'aime bien refaire de zéro mon portfolio de temps en temps. Il y a eu plusieurs technologies au fil des années : Jekyll (en ruby), Jigsaw (en PHP) et actuellement du PHP custom.

# projects.craftworld
source: CraftWorld was a French Minecraft server created in 2011 and closed in 2014. This project was both a hobby and a way to practice and experiment technologies. The game and the website were hosted on two different machines. I developed an API and tools to create interactions between the website and the game. Players could administrate some aspects of the game on the website such as their in-game money and their rank. I also built a full control panel for the staff team which allowed them to administrate the server without being logged in the game. They could see the console log, execute in-game commands, kick/ban players, install new features, start/stop the server, etc.
fr: CraftWorld était un serveur Minecraft français créé en 2011 et fermé en 2014. Ce projet a été à la fois un hobby et un moyen d'expérimenter des technologies. Le jeu et le site étaient hébergée sur des machines différentes, entièrements configurées à la main. J'ai développée une API et des outils pour permettre des interactions entre le site et le jeu. Les joueurs pouvaient gérer certains aspects du jeu (argent du jeu, rang, etc) depuis le site. J'ai aussi créé un pannel administratif pour que le staff puisse gérer le serveur sans devoir se connecter en jeu. Ce pannel permettait de voir les logs, la console de tchat, exécuter des commandes en jeu, installer des plugins, démarrer/arrêter le serveur, etc.
